Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00064.svd
            <register>
               <name>TSCFG</name>
               <description>Timestamp Configuration</description>
               <addressOffset>0x264</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSUE</name>
                     <description>Timestamp Unit Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBCS</name>
                     <description>Timebase Counter Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCP</name>
                     <description>Select Capturing Position</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TBPRE</name>
                     <description>Time Base Prescaler</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSS1</name>
               <description>Timestamp Status 1</description>
               <addressOffset>0x268</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSL</name>
                     <description>Timestamp Lost</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TSN</name>
                     <description>Timestamp New</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSS2</name>
               <description>Timestamp Status 2</description>
               <addressOffset>0x26C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000A000</resetValue>
               <fields>
                  <field>
                     <name>TSP</name>
                     <description>Timestamp Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>NTSG</name>
                     <description>Number of Timestamps Generic</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ITBG</name>
                     <description>Internal Timebase and SOF select Generic</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS0</name>
               <description>Timestamp 0</description>
               <addressOffset>0x270</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS1</name>
               <description>Timestamp 1</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS2</name>
               <description>Timestamp 2</description>
               <addressOffset>0x278</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS3</name>
               <description>Timestamp 3</description>
               <addressOffset>0x27C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS4</name>
               <description>Timestamp 4</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS5</name>
               <description>Timestamp 5</description>
               <addressOffset>0x284</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS6</name>
               <description>Timestamp 6</description>
               <addressOffset>0x288</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS7</name>
               <description>Timestamp 7</description>
               <addressOffset>0x28C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS8</name>
               <description>Timestamp 8</description>
               <addressOffset>0x290</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS9</name>
               <description>Timestamp 9</description>
               <addressOffset>0x294</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS9</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS10</name>
               <description>Timestamp 10</description>
               <addressOffset>0x298</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS10</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS11</name>
               <description>Timestamp 11</description>
               <addressOffset>0x29C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS11</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS12</name>
               <description>Timestamp 12</description>
               <addressOffset>0x2A0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS13</name>
               <description>Timestamp 13</description>
               <addressOffset>0x2A4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS13</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS14</name>
               <description>Timestamp 14</description>
               <addressOffset>0x2A8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS14</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TS15</name>
               <description>Timestamp 15</description>
               <addressOffset>0x2AC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TS</name>
                     <description>Timestamp Word TS15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ATB</name>
               <description>Actual Timebase</description>
               <addressOffset>0x2B0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TB</name>
                     <description>Timebase for timestamp generation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
