Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>H2PB0</name>
         <version>049471a0</version>
         <description>AHB To APB Bridge</description>
         <groupName>H2PB</groupName>
         <prependToName>H2PB_</prependToName>
         <baseAddress>0x44032000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>H2PB CONTROL Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRIV</name>
                     <description>PRIV privileged access protection bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECEN</name>
                     <description>SECEN security enable bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONSECCLRA</name>
               <description>Non-Security Clear Register A</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NONSEC0</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC1</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC2</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC3</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC4</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC5</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC6</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC7</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC8</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC9</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC10</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC11</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC12</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC13</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC14</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC15</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC16</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC17</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC18</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC19</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC20</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC21</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC22</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC23</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC24</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC25</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC26</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC27</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC28</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC29</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC30</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC31</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONSECSETA</name>
               <description>Non-Security SET Register A</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NONSEC0</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC1</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC2</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC3</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC4</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC5</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC6</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC7</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC8</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC9</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC10</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC11</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC12</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC13</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC14</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC15</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC16</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC17</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC18</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC19</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC20</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC21</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC22</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC23</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC24</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC25</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC26</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC27</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC28</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC29</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC30</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NONSEC31</name>
                     <description>non-security bit for APB Slave k, k=0..31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
