Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00064.svd
            <register>
               <dim>9</dim>
               <dimIncrement>4</dimIncrement>
               <name>CLKMSK[%s]</name>
               <description>Peripheral Clock Enable Mask n Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MASK0</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK1</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK2</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK2Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK3</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK3Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK4</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK4Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK5</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK5Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK6</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK6Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK7</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK7Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK8</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK8Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK9</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK9Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK10</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK10Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK11</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK11Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK12</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK12Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK13</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK13Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK14</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK14Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK15</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK15Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK16</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK16Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK17</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK17Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK18</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK18Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK19</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK19Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK20</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK20Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK21</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK21Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK22</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK22Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK23</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK23Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK24</name>
                     <description>Peripheral Clock Enable Mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MASK24Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Peripheral clock mclk_clk_periph[n*32+x] enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK25</name>
