Ac6Embedded/svd-microchip/PIC32CM_GC00/PIC32CM5112GC00064.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>LOCK[%s]</name>
               <description>Peripheral Lock n Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PERID0</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID0Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID1</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID2</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID2Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID3</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID3Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID4</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID4Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID5</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID5Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID6</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID6Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID7</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID7Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID8</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID8Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID9</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID9Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID10</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID10Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID11</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID11Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID12</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID12Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID13</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID13Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID14</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID14Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID15</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID15Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID16</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID16Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID17</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID17Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID18</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID18Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID19</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID19Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID20</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID20Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID21</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID21Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID22</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID22Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID23</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID23Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID24</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID24Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID25</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERID25Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Write Protection Unlocked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Write Protection Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERID26</name>
                     <description>PERID Write Protection Lock Status</description>
                     <bitOffset>26</bitOffset>
